BackEnd_escritura/app/controllers/v1/messages1s_controller.rb

    def index
        @messages1s = Messages1.all
---
SELECT "messages1s".* FROM "messages1s"

    def create
        @message1 = Messages1.new(messages1_params)

        @message1.save
---
INSERT INTO "messages1s" ("nombre", "mensaje", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "santiago"], ["mensaje", "hola prueba 1"], ["created_at", "2024-03-20 13:55:22.941969"], ["updated_at", "2024-03-20 13:55:22.941969"]]

    def destroy
        @message1 = Messages1.where(id: params[:id]).first
        if @message1.destroy
---
SELECT "messages1s".* FROM "messages1s" WHERE "messages1s"."id" = $1 ORDER BY "messages1s"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "messages1s" WHERE "messages1s"."id" = $1  [["id", 6]]